dkrut/esp32-cam-mecanum/ESP32Cam_WIFI_Web/app_httpd.cpp
    if(res){ return httpd_resp_send_500(req); }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, NULL, 0);
}

static esp_err_t wifi_handler(httpd_req_t *req){
    char*  buf;
    size_t buf_len;
    char ssid[33] = {0};
    char pass[65] = {0};
    char mode[4] = {0};

    buf_len = httpd_req_get_url_query_len(req) + 1;
    if (buf_len > 1) {
        buf = (char*)malloc(buf_len);
        if(!buf){
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
            httpd_query_key_value(buf, "ssid", ssid, sizeof(ssid));
            httpd_query_key_value(buf, "pass", pass, sizeof(pass));
            httpd_query_key_value(buf, "mode", mode, sizeof(mode));
            Serial.printf("WiFi query: ssid=%s pass=%s mode=%s\n", ssid, pass, mode);
        }
        free(buf);
    }

    static char json_response[128];
    char * p = json_response;
    *p++ = '{';
    
    bool isStation = strcmp(mode, "STA") == 0;
    if(isStation && strlen(ssid) == 0) {
        p+=sprintf(p, "\"ok\":false,\"error\":\"enter ssid\"");
    } else {
        wifiPrefs.begin("wifi", false);
        wifiPrefs.putString("ssid", ssid);
        wifiPrefs.putString("pass", pass);
        wifiPrefs.putBool("station", isStation);
        wifiPrefs.end();
        Serial.printf("Saved: ssid=%s, station=%d\n", ssid, isStation);
        p+=sprintf(p, "\"ok\":true");
    }
    *p++ = '}';
    *p++ = 0;
    
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, json_response, strlen(json_response));
}

static esp_err_t status_handler(httpd_req_t *req){
    static char json_response[1024];

    sensor_t * s = esp_camera_sensor_get();
    char * p = json_response;
    *p++ = '{';

    p+=sprintf(p, "\"framesize\":%u,", s->status.framesize);
    p+=sprintf(p, "\"quality\":%u,", s->status.quality);
    
    wifiPrefs.begin("wifi", false);
    bool isStation = wifiPrefs.getBool("station", false);
    wifiPrefs.end();
    
    int rssi = 0;
    int num = 0;
    int wifiStatus = WiFi.status();
    
    if(isStation && wifiStatus == WL_CONNECTED) {
        rssi = WiFi.RSSI();
        num = 1;
    } else {
        num = WiFi.softAPgetStationNum();
        if(num > 0) {
            wifi_sta_list_t sta;
            memset(&sta, 0, sizeof(wifi_sta_list_t));
            esp_wifi_ap_get_sta_list(&sta);
            if(sta.num > 0) {
                rssi = (int)sta.sta[0].rssi;
            }
        }
    }
    
    p+=sprintf(p, "\"rssi\":%d,", rssi);
    p+=sprintf(p, "\"num\":%d,", num);
    p+=sprintf(p, "\"mode\":\"%s\"", isStation ? "STA" : "AP");
    *p++ = '}';
    *p++ = 0;
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, json_response, strlen(json_response));
}

static esp_err_t wifi_status_handler(httpd_req_t *req){
    wifiPrefs.begin("wifi", false);
    bool station = wifiPrefs.getBool("station", false);
    String ssid = wifiPrefs.getString("ssid", "");
    wifiPrefs.end();
    static char json_response[256];
    char * p = json_response;
    *p++ = '{';
    p+=sprintf(p, "\"station\":%d,", station);
    p+=sprintf(p, "\"ssid\":\"%s\",", ssid.c_str());
    p+=sprintf(p, "\"ip\":\"192.168.1.250\"");
    *p++ = '}';
    *p++ = 0;
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, json_response, strlen(json_response));
}

static const char PROGMEM INDEX_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
    <head>
        <meta charset="utf-8">
        <meta name="viewport" content="width=device-width,initial-scale=1,user-scalable=no">
        <title>ESP32-CAM Robot</title>
        <style>
            :root{--bg-primary:#1a1a2e;--bg-secondary:#16213e;--bg-gradient:linear-gradient(135deg,#1a1a2e 0%,#16213e 100%);--accent:#667eea;--accent-secondary:#764ba2;--text-primary:#fff;--text-secondary:#888;--success:#00ff00}
            *{box-sizing:border-box;margin:0;padding:0;-webkit-user-select:none;-webkit-touch-callout:none}
            body{background:var(--bg-gradient);font-family:'Segoe UI',sans-serif;color:var(--text-primary);min-height:100vh;overflow-x:hidden;max-width:640px;margin:0 auto;padding:8px}
            .header{background:rgba(0,0,0,0.5);padding:6px 12px;display:flex;justify-content:space-between;align-items:center;border-radius:15px;margin-bottom:1px;font-size:11px;font-family:monospace}
            .status-left{display:flex;align-items:center;gap:4px;font-size:11px}
            .status-dot{width:6px;height:6px;border-radius:50%;background:var(--success);animation:pulse 2s infinite;transition:background 0.3s}
            .status-dot.disconnected{background:#f00;animation:none}
            .mode-right{font-size:11px;font-weight:600;color:#0f0}
            .video-section{padding:4px;text-align:center}
            .video-container{position:relative;width:100%;max-width:640px;margin:0 auto;border-radius:16px;overflow:hidden;background:#000;aspect-ratio:4/3;display:none}
            .video-container.show{display:block}
            .video-container img{width:100%;height:100%;object-fit:cover}
            .video-controls{display:flex;justify-content:center;gap:10px;padding:8px;background:rgba(0,0,0,0.6);border-radius:16px}
            .btn{background:rgba(255,255,255,0.15);border:none;color:#fff;padding:5px 14px;border-radius:25px;font-size:12px;cursor:pointer;transition:all 0.2s;-webkit-user-select:none;user-select:none;-webkit-touch-callout:none}
            .btn:active,.btn.active{background:var(--accent)}
            .btn:active{background:var(--accent);transform:scale(0.95)}
            .btn.active{background:var(--accent)}
            .joystick-section{margin-top:-4px;padding:4px 16px;text-align:center}
            .joystick-area{position:relative;width:220px;height:220px;margin:0 auto;background:rgba(0,0,0,0.4);border-radius:40px;padding:12px;border:2px solid var(--accent)}
            .direction-grid{display:grid;grid-template-columns:repeat(3,1fr);grid-template-rows:repeat(3,1fr);gap:8px;height:100%}
            .grid-cell{background:rgba(255,255,255,0.1);border-radius:16px;display:flex;align-items:center;justify-content:center;font-size:1.4rem;color:#eceff8;cursor:pointer;transition:all 0.07s;border:1px solid rgba(255,255,255,0.15);-webkit-user-select:none;user-select:none;-webkit-tap-highlight-color:transparent;-webkit-touch-callout:none}
            .grid-cell:active,.grid-cell.active{background:var(--accent);color:#fff}
            .grid-cell.center{background:rgba(0,0,0,0.3);box-shadow:inset 0 0 0 1px var(--accent);cursor:default;color:#666}
            .turn-btn{position:absolute;width:45px;height:80px;background:linear-gradient(135deg,#f093fb,#f5576c);border:none;color:#fff;border-radius:22px 6px 6px 22px;font-size:11px;font-weight:bold;cursor:pointer;top:50%;transform:translateY(-50%);z-index:5;-webkit-user-select:none;user-select:none;-webkit-touch-callout:none;display:flex;flex-direction:column;align-items:center;justify-content:center;line-height:1.2}
            .turn-btn span{display:block}
            .turn-btn:active,.turn-btn.active{background:linear-gradient(135deg,#ff6b6b,#ee5a5a);transform:translateY(-50%) translateY(2px)}
            .turn-btn.left{left:-55px}
            .turn-btn.right{right:-55px;border-radius:6px 22px 22px 6px}
            @media(max-width:380px){
                .settings-section{padding:0 16px 2px}
                .setting-row{margin-bottom:2px}
                .joystick-area{width:180px;height:180px;padding:8px;border-radius:30px}
                .direction-grid{gap:5px}
                .grid-cell{font-size:1.1rem;border-radius:12px}
                .turn-btn{width:35px;height:60px;font-size:10px}
                .turn-btn.left{left:-45px}
                .turn-btn.right{right:-45px}
            }
            .settings-section{padding:0 16px 4px}
            .setting-row{background:rgba(255,255,255,0.08);border-radius:40px;padding:6px 12px;display:flex;align-items:center;gap:10px;border:1px solid rgba(255,255,255,0.1);margin-bottom:4px}
            .setting-label{font-size:11px;font-weight:500;width:45px;flex-shrink:0;white-space:nowrap}
            .setting-slider{flex:1;height:4px;-webkit-appearance:none;background:linear-gradient(90deg,var(--accent),var(--accent-secondary));border-radius:5px}
            .setting-slider::-webkit-slider-thumb{-webkit-appearance:none;width:18px;height:18px;background:#fff;border-radius:50%;cursor:pointer;border:2px solid var(--accent)}
            .setting-value{background:rgba(0,0,0,0.5);padding:4px 10px;border-radius:25px;font-size:12px;width:45px;text-align:center}
            .mode-section{padding:1px 16px 8px}
            .mode-buttons{display:flex;gap:8px;flex-wrap:wrap}
            .mode-btn{flex:1;min-width:70px;background:rgba(255,255,255,0.1);border:1px solid rgba(255,255,255,0.2);color:#fff;padding:8px 4px;border-radius:30px;font-size:11px;font-weight:600;cursor:pointer;transition:all 0.2s;text-align:center;-webkit-user-select:none;user-select:none;-webkit-touch-callout:none}
            .mode-btn:active,.mode-btn.selected{background:var(--accent);border-color:transparent}
            .wifi-section{padding:4px 16px 16px}
            .wifi-section .section-title{font-size:12px;font-weight:600;margin-bottom:8px;color:var(--text-secondary)}
            .wifi-mode-toggle{display:flex;gap:12px}
            .wifi-mode-toggle label{font-size:11px;cursor:pointer}
            .wifi-mode-toggle input{margin-right:4px}
            .wifi-input{flex:1;background:rgba(255,255,255,0.1);border:1px solid rgba(255,255,255,0.2);color:#fff;padding:6px 10px;border-radius:20px;font-size:11px}
            .wifi-info{font-size:10px;color:var(--text-secondary);margin-top:6px;text-align:center}
            #btn-wifi-save{background:var(--accent);width:100%;margin-top:4px}
            #wifi-sta-fields{display:flex;flex-direction:column}
            @media(min-width:641px){
                .header,.video-section,.settings-section,.joystick-section,.mode-section,.wifi-section{padding-left:0;padding-right:0}
                .header{font-size:13px;padding:8px 16px}
                .btn{padding:8px 20px;font-size:13px}
                .setting-row{padding:8px 16px;width:100%;max-width:640px;margin:0 auto 4px}
                .setting-label{font-size:12px;width:50px}
                .setting-slider{flex:1}
                .setting-value{font-size:13px}
                .mode-btn{font-size:12px;padding:10px 8px}
                .wifi-section .section-title{font-size:13px}
                .wifi-mode-toggle label{font-size:12px}
                .wifi-input{font-size:12px;padding:8px 12px}
            }
            @keyframes pulse{0%,100%{opacity:1}50%{opacity:0.5}}
        </style>
    </head>
    <body>
        <div class="header">
            <div class="status-left"><span class="status-dot"></span> 📡 <span id="rssi-val">...</span></div>
            <div class="mode-right" id="current-mode">🎮 Mode: Free Control</div>
        </div>

        <div class="video-section">
            <div class="video-container" id="video-container"><img id="stream" src="" alt="Camera"></div>
            <div class="video-controls">
                <button class="btn" id="btn-start">▶ Start</button>
                <button class="btn" id="btn-capture">📸 Snapshot</button>
                <button class="btn" id="btn-stop">⏹ Stop</button>
            </div>
        </div>

