dkrut/esp32-cam-mecanum/ESP32Cam_WIFI_Web/app_httpd.cpp
        <div class="settings-section">
            <div class="setting-row">
                <span class="setting-label">🔄 Servo</span>
                <input type="range" class="setting-slider" id="servo" min="0" max="180" value="90">
                <span class="setting-value" id="servo-val">90</span>
            </div>
            <div class="setting-row">
                <span class="setting-label">⚡ Speed</span>
                <input type="range" class="setting-slider" id="speed" min="150" max="255" value="220">
                <span class="setting-value" id="speed-val">220</span>
            </div>
            <div class="setting-row">
                <span class="setting-label">💡 LED</span>
                <input type="range" class="setting-slider" id="flash" min="0" max="255" value="0">
                <span class="setting-value" id="flash-val">0</span>
            </div>
        </div>

        <div class="joystick-section">
            <div class="joystick-area">
                <div class="direction-grid">
                    <div class="grid-cell" id="btn-ul">↖</div>
                    <div class="grid-cell" id="btn-up">↑</div>
                    <div class="grid-cell" id="btn-ur">↗</div>
                    <div class="grid-cell" id="btn-left">←</div>
                    <div class="grid-cell center">⚫</div>
                    <div class="grid-cell" id="btn-right">→</div>
                    <div class="grid-cell" id="btn-dl">↙</div>
                    <div class="grid-cell" id="btn-down">↓</div>
                    <div class="grid-cell" id="btn-dr">↘</div>
                </div>
                <button class="turn-btn left" id="btn-ccw"><span>Left</span><span>↺</span></button>
                <button class="turn-btn right" id="btn-cw"><span>Right</span><span>↻</span></button>
            </div>
        </div>

        <div class="mode-section">
            <div class="mode-buttons">
                <button class="mode-btn selected">Free Control</button>
                <button class="mode-btn">Obstacle</button>
                <button class="mode-btn">Following</button>
                <button class="mode-btn">Line Trace</button>
            </div>
        </div>

        <div class="wifi-section">
            <div class="section-title">WiFi Settings</div>
            <div class="setting-row">
                <span class="setting-label">Mode</span>
                <div class="wifi-mode-toggle">
                    <label><input type="radio" name="wifiMode" id="wifi-mode-ap" value="AP"> Access Point (192.168.4.1)</label>
                    <label><input type="radio" name="wifiMode" id="wifi-mode-sta" value="STA"> Wi-Fi Client (192.168.1.250)</label>
                </div>
            </div>
            <div id="wifi-sta-fields">
                <div class="setting-row">
                    <span class="setting-label">SSID</span>
                    <input type="text" class="wifi-input" id="wifi-ssid" placeholder="WiFi SSID">
                </div>
                <div class="setting-row">
                    <span class="setting-label">Pass</span>
                    <input type="password" class="wifi-input" id="wifi-pass" placeholder="WiFi Password">
                </div>
            </div>
            <div class="setting-row">
                <button class="btn" id="btn-wifi-save">Save & Connect</button>
            </div>
            <div class="wifi-info" id="wifi-info"></div>
        </div>

        <script>
            const BASE_URL = location.origin;
            let currentDir = 3;

            function loadWifiSettings(){
                fetch(BASE_URL+'/wifi-status').then(r=>r.json()).then(d=>{
                    if(d.station){
                        document.getElementById('wifi-mode-sta').checked = true;
                        document.getElementById('wifi-ssid').value = d.ssid || '';
                    }else{
                        document.getElementById('wifi-mode-ap').checked = true;
                    }
                    toggleWifiFields();
                }).catch(()=>{});
            }

            function toggleWifiFields(){
                const sta = document.getElementById('wifi-mode-sta').checked;
                document.getElementById('wifi-sta-fields').style.display = sta ? 'flex' : 'none';
            }

            loadWifiSettings();

            function updateStatus(){
                const el = document.getElementById('rssi-val');
                const statusDot = document.querySelector('.status-dot');

                fetch(BASE_URL+'/status')
                    .then(r => r.json())
                    .then(d => {
                        statusDot.className = 'status-dot';
                        if(d.rssi && d.rssi > -120) {
                            el.textContent = 'RSSI ' + d.rssi + ' dBm';
                            el.style.color = d.rssi > -50 ? '#0f0' : (d.rssi > -70 ? '#ff0' : '#f00');
                        } else if(d.num > 0) {
                            el.textContent = 'RSSI ' + d.rssi + ' dBm (' + d.num + ' client' + (d.num>1?'s':'') + ')';
                            el.style.color = d.rssi > -50 ? '#0f0' : (d.rssi > -70 ? '#ff0' : '#f00');
                        } else {
                            el.textContent = 'RSSI: --';
                            el.style.color = '#888';
                        }
                        if(d.mode === 'AP' && d.num > 0) {
                            document.getElementById('wifi-info').textContent = d.num + ' client' + (d.num > 1 ? 's' : '') + ' connected';
                        } else {
                            document.getElementById('wifi-info').textContent = '';
                        }
                    })
                    .catch(() => {
                        el.textContent = '\u26A0 Disconnected';
                        el.style.color = '#f00';
                        statusDot.className = 'status-dot disconnected';
                    });
            }
            setInterval(updateStatus,5000);
            updateStatus();

