dkrut/esp32-cam-mecanum/ESP32Cam_WIFI_Web/app_httpd.cpp
            function sendCmd(cmd,val){fetch(BASE_URL+'/control?var='+cmd+'&val='+val)}

            function startStream(){
                document.getElementById('stream').src = BASE_URL+':81/stream';
                document.getElementById('video-container').classList.add('show');
                document.getElementById('btn-start').classList.add('active');
            }
            function stopStream(){
                document.getElementById('stream').src = '';
                document.getElementById('video-container').classList.remove('show');
                document.querySelectorAll('.video-controls .btn').forEach(b => b.classList.remove('active'));
            }
            function captureFrame(){
                document.getElementById('stream').src = BASE_URL+'/capture?_cb='+Date.now();
                document.getElementById('video-container').classList.add('show');
                document.querySelectorAll('.video-controls .btn').forEach(b => b.classList.remove('active'));
            }

            function updateSetting(id,val){
                document.getElementById(id+'-val').textContent = val;
                sendCmd(id,val);
            }

            function setMode(val){
                document.querySelectorAll('.mode-btn').forEach(b => b.classList.remove('selected'));
                document.querySelectorAll('.mode-btn')[val-1].classList.add('selected');
                const modes = ['Free Control','Obstacle','Following','Line Trace'];
                document.getElementById('current-mode').textContent = '\uD83C\uDFAE Mode: '+modes[val-1];
                sendCmd('model',val);
            }

            function saveWifiSettings(){
                const mode = document.querySelector('input[name="wifiMode"]:checked').value;
                const ssid = document.getElementById('wifi-ssid').value;
                const pass = document.getElementById('wifi-pass').value;

                if(mode === 'STA' && !ssid){
                    document.getElementById('wifi-info').textContent = 'Error: Enter SSID';
                    return;
                }
                if(mode === 'STA' && pass.length > 0 && pass.length < 8){
                    document.getElementById('wifi-info').textContent = 'Error: Password must be at least 8 characters';
                    return;
                }

                document.getElementById('wifi-info').textContent = 'Saving...';
                const url = BASE_URL+'/wifi?ssid='+encodeURIComponent(ssid)+'&pass='+encodeURIComponent(pass)+'&mode='+mode;
                fetch(url).then(r=>r.json()).then(d=>{
                    document.getElementById('wifi-info').textContent = d.ok ? 'Saved! Reboot ESP32!' : 'Error: ' + d.error;
                }).catch(e => {
                    document.getElementById('wifi-info').textContent = 'Error: ' + e;
                });
            }

            function press(dir){
                if(currentDir === 3 && dir !== 3){
                    document.querySelectorAll('.mode-btn')[0].classList.add('selected');
                    document.querySelectorAll('.mode-btn').forEach((b,i) => {if(i>0)b.classList.remove('selected')});
                    document.getElementById('current-mode').textContent = '\uD83C\uDFAE Mode: Free Control';
                }
                sendCmd('car',dir);
                currentDir = dir;
                highlightArrow(dir);
                if(navigator.vibrate) navigator.vibrate(15);
            }

            function release(){
                sendCmd('car',3);
                currentDir = 3;
                clearArrows();
                if(navigator.vibrate) navigator.vibrate(10);
            }

            function highlightArrow(dir){
                clearArrows();
                const map = {1:'up',2:'right',4:'left',5:'down',6:'ul',7:'ur',8:'dl',9:'dr',10:'cw',15:'ccw'};
                const idx = map[dir];
                if(idx){
                    const cell = document.getElementById('btn-'+idx);
                    if(cell) cell.classList.add('active');
                }
            }

            function clearArrows(){
                const btns = document.querySelectorAll('.grid-cell, .turn-btn');
                for(let i = 0; i < btns.length; i++){
                    btns[i].classList.remove('active');
                }
            }

            document.getElementById('btn-start').addEventListener('click', startStream);
            document.getElementById('btn-capture').addEventListener('click', captureFrame);
            document.getElementById('btn-stop').addEventListener('click', stopStream);

            document.getElementById('servo').addEventListener('input', function(){
                updateSetting('servo', this.value);
            });
            document.getElementById('speed').addEventListener('input', function(){
                updateSetting('speed', this.value);
            });
            document.getElementById('flash').addEventListener('input', function(){
                updateSetting('flash', this.value);
            });

            const dirBtns = {ul:6, up:1, ur:7, left:4, right:2, dl:8, down:5, dr:9};
            for(const [id, dir] of Object.entries(dirBtns)){
                const btn = document.getElementById('btn-'+id);
                if(!btn) continue;
                btn.addEventListener('mousedown', function(e){e.preventDefault(); press(dir)});
                btn.addEventListener('mouseup', release);
                btn.addEventListener('mouseleave', release);
                btn.addEventListener('touchstart', function(e){e.preventDefault(); press(dir)});
                btn.addEventListener('touchend', release);
                btn.addEventListener('touchcancel', release);
            }

            const centerBtn = document.querySelector('.grid-cell.center');
            if(centerBtn){
                centerBtn.addEventListener('mousedown', function(e){e.preventDefault(); release()});
                centerBtn.addEventListener('touchstart', function(e){e.preventDefault(); release()});
            }

            document.getElementById('btn-ccw').addEventListener('mousedown', function(e){e.preventDefault(); press(15)});
            document.getElementById('btn-ccw').addEventListener('mouseup', release);
            document.getElementById('btn-ccw').addEventListener('mouseleave', release);
            document.getElementById('btn-ccw').addEventListener('touchstart', function(e){e.preventDefault(); press(15)});
            document.getElementById('btn-ccw').addEventListener('touchend', release);
            document.getElementById('btn-ccw').addEventListener('touchcancel', release);

