dkrut/esp32-cam-mecanum/ESP32Cam_WIFI_Web/app_httpd.cpp
            document.getElementById('btn-cw').addEventListener('mousedown', function(e){e.preventDefault(); press(10)});
            document.getElementById('btn-cw').addEventListener('mouseup', release);
            document.getElementById('btn-cw').addEventListener('mouseleave', release);
            document.getElementById('btn-cw').addEventListener('touchstart', function(e){e.preventDefault(); press(10)});
            document.getElementById('btn-cw').addEventListener('touchend', release);
            document.getElementById('btn-cw').addEventListener('touchcancel', release);

            document.querySelectorAll('.mode-btn').forEach((btn, i) => {
                btn.addEventListener('click', () => setMode(i + 1));
            });

            document.getElementById('wifi-mode-ap').addEventListener('change', toggleWifiFields);
            document.getElementById('wifi-mode-sta').addEventListener('change', toggleWifiFields);
            document.getElementById('btn-wifi-save').addEventListener('click', saveWifiSettings);
        </script>
    </body>
</html>
)rawliteral";

static esp_err_t index_handler(httpd_req_t *req){
    httpd_resp_set_type(req, "text/html");
    return httpd_resp_send(req, (const char *)INDEX_HTML, strlen(INDEX_HTML));
}

void startCameraServer()
{
    wifiPrefs.begin("wifi", false);
    bool wantStation = wifiPrefs.getBool("station", false);
    String staSsid = wifiPrefs.getString("ssid", "");
    Serial.printf("Prefs: station=%d, ssid=%s\n", wantStation, staSsid.c_str());
    bool wifiStationMode = false;
    
    if(wantStation && staSsid.length() > 0) {
        String staPass = wifiPrefs.getString("pass", "");
        WiFi.mode(WIFI_STA);
        WiFi.config(IPAddress(192,168,1,250), IPAddress(192,168,1,1), IPAddress(255,255,255,0));
        WiFi.begin(staSsid.c_str(), staPass.c_str());
        int timeout = 20;
        while(WiFi.status() != WL_CONNECTED && timeout > 0) {
            delay(500);
            timeout--;
        }
        if(WiFi.status() == WL_CONNECTED) {
            Serial.print("Connected to WiFi. IP: ");
            Serial.println(WiFi.localIP());
            wifiStationMode = true;
        } else {
            Serial.println("Failed to connect to WiFi, falling back to AP");
            WiFi.mode(WIFI_AP);
        }
    }
    
    if(!wifiStationMode) {
        WiFi.mode(WIFI_AP);
        WiFi.softAP("KUONGSHUN-AD176", "12345678", 5);
    }
    wifiPrefs.end();
    
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    
    httpd_uri_t index_uri = {
        .uri       = "/",
        .method    = HTTP_GET,
        .handler   = index_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t status_uri = {
        .uri       = "/status",
        .method    = HTTP_GET,
        .handler   = status_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t cmd_uri = {
        .uri       = "/control",
        .method    = HTTP_GET,
        .handler   = cmd_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t capture_uri = {
        .uri       = "/capture",
        .method    = HTTP_GET,
        .handler   = capture_handler,
        .user_ctx  = NULL
    };

   httpd_uri_t stream_uri = {
        .uri       = "/stream",
        .method    = HTTP_GET,
        .handler   = stream_handler,
        .user_ctx  = NULL
    };
    
    httpd_uri_t wifi_uri = {
        .uri       = "/wifi",
        .method    = HTTP_GET,
        .handler   = wifi_handler,
        .user_ctx  = NULL
    };
    
    httpd_uri_t wifi_status_uri = {
        .uri       = "/wifi-status",
        .method    = HTTP_GET,
        .handler   = wifi_status_handler,
        .user_ctx  = NULL
    };
    
    Serial.printf("Starting web server on port: '%d'\n", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(camera_httpd, &index_uri);
        httpd_register_uri_handler(camera_httpd, &cmd_uri);
        httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
        httpd_register_uri_handler(camera_httpd, &wifi_uri);
        httpd_register_uri_handler(camera_httpd, &wifi_status_uri);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    Serial.printf("Starting stream server on port: '%d'\n", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
    }
}
